Revit 2024 API
RebarShapeDefinitionBySegments.AddBendVariableRadius Method
 Specify a variable-radius bend.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public void AddBendVariableRadius(
	int vertexIndex,
	RebarShapeVertexTurn turn,
	RebarShapeBendAngle angle,
	ElementId paramId,
	bool measureIncludingBarThickness
)
Visual Basic
Public Sub AddBendVariableRadius ( _
	vertexIndex As Integer, _
	turn As RebarShapeVertexTurn, _
	angle As RebarShapeBendAngle, _
	paramId As ElementId, _
	measureIncludingBarThickness As Boolean _
)
Visual C++
public:
void AddBendVariableRadius(
	int vertexIndex,
	RebarShapeVertexTurn turn,
	RebarShapeBendAngle angle,
	ElementId^ paramId,
	bool measureIncludingBarThickness
)
Parameters
vertexIndex
Type: System.Int32
 Index of the vertex (1 to NumberOfVertices - 2).
turn
Type: Autodesk.Revit.DB.Structure.RebarShapeVertexTurn
 Specify turn direction (RebarShapeVertexTurn::Left or RebarShapeVertexTurn::Right).
angle
Type: Autodesk.Revit.DB.Structure.RebarShapeBendAngle
 Specify whether the bend is acute, obtuse, etc.
paramId
Type: Autodesk.Revit.DB.ElementId
 Id of a parameter driving the radius.
measureIncludingBarThickness
Type: System.Boolean
 If true, the radius is measured to the outside of the bend; if false, it is measured to the inside.
Remarks
 You must add a bend between each two segments.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  vertexIndex is not between 0 and NumberOfVertices. -or- paramId is not the id of a shared parameter in the current document, or its unit type is not UT_Reinforcement_Length or UT_Angle.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
RebarShapeDefinitionBySegments Class
Autodesk.Revit.DB.Structure Namespace